data/creacion.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZMM_GOODSMVT_CREATE_SOLO>
         <FI_HEADER>
            <PSTNG_DATE>2019-05-22</PSTNG_DATE>
            <DOC_DATE>2019-05-22</DOC_DATE>
            <REF_DOC_NO></REF_DOC_NO>
            <BILL_OF_LADING></BILL_OF_LADING>
            <GR_GI_SLIP_NO></GR_GI_SLIP_NO>
            <PR_UNAME>IF_PDM</PR_UNAME>
            <HEADER_TXT></HEADER_TXT>
            <VER_GR_GI_SLIP></VER_GR_GI_SLIP>
            <VER_GR_GI_SLIPX></VER_GR_GI_SLIPX>
            <EXT_WMS></EXT_WMS>
            <REF_DOC_NO_LONG></REF_DOC_NO_LONG>
            <BILL_OF_LADING_LONG></BILL_OF_LADING_LONG>
            <BAR_CODE></BAR_CODE>
         </FI_HEADER>
         <FI_ITEM>
            <!--Zero or more repetitions:-->
            <item>
               <MATERIAL>120010101</MATERIAL>
               <PLANT>5010</PLANT>
               <STGE_LOC>A001</STGE_LOC>
               <BATCH>HZ082B125</BATCH>
               <MOVE_TYPE>971</MOVE_TYPE>
               <STCK_TYPE></STCK_TYPE>
               <SPEC_STOCK></SPEC_STOCK>
               <VENDOR></VENDOR>
               <CUSTOMER></CUSTOMER>
               <SALES_ORD></SALES_ORD>
               <S_ORD_ITEM></S_ORD_ITEM>
               <SCHED_LINE></SCHED_LINE>
               <VAL_TYPE></VAL_TYPE>
               <ENTRY_QNT>1</ENTRY_QNT>
               <ENTRY_UOM>ST</ENTRY_UOM>
               <ENTRY_UOM_ISO></ENTRY_UOM_ISO>
               <PO_PR_QNT></PO_PR_QNT>
               <ORDERPR_UN></ORDERPR_UN>
               <ORDERPR_UN_ISO></ORDERPR_UN_ISO>
               <PO_NUMBER></PO_NUMBER>
               <PO_ITEM></PO_ITEM>
               <SHIPPING></SHIPPING>
               <COMP_SHIP></COMP_SHIP>
               <NO_MORE_GR></NO_MORE_GR>
               <ITEM_TEXT></ITEM_TEXT>
               <GR_RCPT></GR_RCPT>
               <UNLOAD_PT></UNLOAD_PT>
               <COSTCENTER></COSTCENTER>
               <ORDERID></ORDERID>
               <ORDER_ITNO></ORDER_ITNO>
               <CALC_MOTIVE></CALC_MOTIVE>
               <ASSET_NO></ASSET_NO>
               <SUB_NUMBER></SUB_NUMBER>
               <RESERV_NO></RESERV_NO>
               <RES_ITEM></RES_ITEM>
               <RES_TYPE></RES_TYPE>
               <WITHDRAWN></WITHDRAWN>
               <MOVE_MAT></MOVE_MAT>
               <MOVE_PLANT>5010</MOVE_PLANT>
               <MOVE_STLOC>A001</MOVE_STLOC>
               <MOVE_BATCH>HZ082B125</MOVE_BATCH>
               <MOVE_VAL_TYPE></MOVE_VAL_TYPE>
               <MVT_IND></MVT_IND>
               <MOVE_REAS></MOVE_REAS>
               <RL_EST_KEY></RL_EST_KEY>
               <REF_DATE></REF_DATE>
               <COST_OBJ></COST_OBJ>
               <PROFIT_SEGM_NO></PROFIT_SEGM_NO>
               <PROFIT_CTR></PROFIT_CTR>
               <WBS_ELEM></WBS_ELEM>
               <NETWORK></NETWORK>
               <ACTIVITY></ACTIVITY>
               <PART_ACCT></PART_ACCT>
               <AMOUNT_LC>10.0</AMOUNT_LC>
               <AMOUNT_SV>10.0</AMOUNT_SV>
               <REF_DOC_YR></REF_DOC_YR>
               <REF_DOC></REF_DOC>
               <REF_DOC_IT></REF_DOC_IT>
               <EXPIRYDATE></EXPIRYDATE>
               <PROD_DATE></PROD_DATE>
               <FUND></FUND>
               <FUNDS_CTR></FUNDS_CTR>
               <CMMT_ITEM></CMMT_ITEM>
               <VAL_SALES_ORD></VAL_SALES_ORD>
               <VAL_S_ORD_ITEM></VAL_S_ORD_ITEM>
               <VAL_WBS_ELEM></VAL_WBS_ELEM>
               <GL_ACCOUNT></GL_ACCOUNT>
               <IND_PROPOSE_QUANX></IND_PROPOSE_QUANX>
               <XSTOB></XSTOB>
               <EAN_UPC></EAN_UPC>
               <DELIV_NUMB_TO_SEARCH></DELIV_NUMB_TO_SEARCH>
               <DELIV_ITEM_TO_SEARCH></DELIV_ITEM_TO_SEARCH>
               <SERIALNO_AUTO_NUMBERASSIGNMENT></SERIALNO_AUTO_NUMBERASSIGNMENT>
               <VENDRBATCH></VENDRBATCH>
               <STGE_TYPE></STGE_TYPE>
               <STGE_BIN></STGE_BIN>
               <SU_PL_STCK_1></SU_PL_STCK_1>
               <ST_UN_QTYY_1></ST_UN_QTYY_1>
               <ST_UN_QTYY_1_ISO></ST_UN_QTYY_1_ISO>
               <UNITTYPE_1></UNITTYPE_1>
               <SU_PL_STCK_2></SU_PL_STCK_2>
               <ST_UN_QTYY_2></ST_UN_QTYY_2>
               <ST_UN_QTYY_2_ISO></ST_UN_QTYY_2_ISO>
               <UNITTYPE_2></UNITTYPE_2>
               <STGE_TYPE_PC></STGE_TYPE_PC>
               <STGE_BIN_PC></STGE_BIN_PC>
               <NO_PST_CHGNT></NO_PST_CHGNT>
               <GR_NUMBER></GR_NUMBER>
               <STGE_TYPE_ST></STGE_TYPE_ST>
               <STGE_BIN_ST></STGE_BIN_ST>
               <MATDOC_TR_CANCEL></MATDOC_TR_CANCEL>
               <MATITEM_TR_CANCEL></MATITEM_TR_CANCEL>
               <MATYEAR_TR_CANCEL></MATYEAR_TR_CANCEL>
               <NO_TRANSFER_REQ></NO_TRANSFER_REQ>
               <CO_BUSPROC></CO_BUSPROC>
               <ACTTYPE></ACTTYPE>
               <SUPPL_VEND></SUPPL_VEND>
               <MATERIAL_EXTERNAL></MATERIAL_EXTERNAL>
               <MATERIAL_GUID></MATERIAL_GUID>
               <MATERIAL_VERSION></MATERIAL_VERSION>
               <MOVE_MAT_EXTERNAL></MOVE_MAT_EXTERNAL>
               <MOVE_MAT_GUID></MOVE_MAT_GUID>
               <MOVE_MAT_VERSION></MOVE_MAT_VERSION>
               <FUNC_AREA></FUNC_AREA>
               <TR_PART_BA></TR_PART_BA>
               <PAR_COMPCO></PAR_COMPCO>
               <DELIV_NUMB></DELIV_NUMB>
               <DELIV_ITEM></DELIV_ITEM>
               <NB_SLIPS></NB_SLIPS>
               <NB_SLIPSX></NB_SLIPSX>
               <GR_RCPTX></GR_RCPTX>
               <UNLOAD_PTX></UNLOAD_PTX>
               <SPEC_MVMT></SPEC_MVMT>
               <GRANT_NBR></GRANT_NBR>
               <CMMT_ITEM_LONG></CMMT_ITEM_LONG>
               <FUNC_AREA_LONG></FUNC_AREA_LONG>
               <LINE_ID></LINE_ID>
               <PARENT_ID></PARENT_ID>
               <LINE_DEPTH></LINE_DEPTH>
               <QUANTITY></QUANTITY>
               <BASE_UOM></BASE_UOM>
               <LONGNUM></LONGNUM>
               <BUDGET_PERIOD></BUDGET_PERIOD>
               <EARMARKED_NUMBER></EARMARKED_NUMBER>
               <EARMARKED_ITEM></EARMARKED_ITEM>
               <STK_SEGMENT></STK_SEGMENT>
               <MOVE_SEGMENT></MOVE_SEGMENT>
               <MATERIAL_LONG></MATERIAL_LONG>
               <MOVE_MAT_LONG></MOVE_MAT_LONG>
               <STK_SEG_LONG></STK_SEG_LONG>
               <MOV_SEG_LONG></MOV_SEG_LONG>
               <CREATE_DELIVERY></CREATE_DELIVERY>
            </item>
         </FI_ITEM>
      </urn:ZMM_GOODSMVT_CREATE_SOLO>
   </soapenv:Body>
</soapenv:Envelope>